# CanBeDivisionProfile Method (ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..CanBeDivisionProfile Method (ElementId)
PartMakerMethodToDivideVolumes Class See Also
---
Checks whether a family defines a profile which can be used by this method.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool CanBeDivisionProfile(
	ElementId familyId
)
```

Visual Basic
---
```text
Public Function CanBeDivisionProfile ( _
	familyId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool CanBeDivisionProfile(
	ElementId^ familyId
)
```

# ### Parameters
familyId
    Type: Autodesk.Revit.DB..::..ElementId Element id of the family.
# ### Return Value
True if the family defines a profile which can be used by a part maker, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartMakerMethodToDivideVolumes Class
CanBeDivisionProfile Overload
Autodesk.Revit.DB Namespace